perfTest/stage4/put.txt
Running 10s test @ http://localhost:8080
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  439.75us   5.97ms   70.13%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.26ms
 75.000%    1.55ms
 90.000%    1.78ms
 99.000%    2.39ms
 99.900%    4.46ms
 99.990%    5.59ms
 99.999%    5.97ms
100.000%    5.97ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.246     0.000000            1         1.00
       0.746     0.100000         1003         1.11
       0.889     0.200000         2001         1.25
       1.013     0.300000         3004         1.43
       1.134     0.400000         4002         1.67
       1.263     0.500000         4999         2.00
       1.320     0.550000         5500         2.22
       1.379     0.600000         6013         2.50
       1.438     0.650000         6501         2.86
       1.497     0.700000         7000         3.33
       1.555     0.750000         7503         4.00
       1.586     0.775000         7750         4.44
       1.619     0.800000         8001         5.00
       1.658     0.825000         8250         5.71
       1.696     0.850000         8503         6.67
       1.741     0.875000         8754         8.00
       1.759     0.887500         8874         8.89
       1.782     0.900000         8999        10.00
       1.805     0.912500         9126        11.43
       1.831     0.925000         9250        13.33
       1.869     0.937500         9375        16.00
       1.895     0.943750         9437        17.78
       1.934     0.950000         9502        20.00
       1.987     0.956250         9561        22.86
       2.061     0.962500         9625        26.67
       2.131     0.968750         9687        32.00
       2.161     0.971875         9717        35.56
       2.197     0.975000         9749        40.00
       2.237     0.978125         9785        45.71
       2.269     0.981250         9812        53.33
       2.297     0.984375         9843        64.00
       2.317     0.985938         9858        71.11
       2.347     0.987500         9874        80.00
       2.377     0.989062         9890        91.43
       2.399     0.990625         9908       106.67
       2.411     0.992188         9920       128.00
       2.425     0.992969         9930       142.22
       2.449     0.993750         9936       160.00
       2.481     0.994531         9944       182.86
       2.519     0.995313         9952       213.33
       2.553     0.996094         9959       256.00
       2.803     0.996484         9963       284.44
       2.979     0.996875         9967       320.00
       3.137     0.997266         9971       365.71
       3.481     0.997656         9975       426.67
       3.579     0.998047         9979       512.00
       3.921     0.998242         9981       568.89
       4.021     0.998437         9983       640.00
       4.187     0.998633         9985       731.43
       4.431     0.998828         9987       853.33
       4.531     0.999023         9989      1024.00
       4.591     0.999121         9990      1137.78
       4.643     0.999219         9991      1280.00
       4.695     0.999316         9992      1462.86
       4.835     0.999414         9993      1706.67
       4.899     0.999512         9994      2048.00
       4.899     0.999561         9994      2275.56
       4.951     0.999609         9995      2560.00
       4.951     0.999658         9995      2925.71
       4.995     0.999707         9996      3413.33
       4.995     0.999756         9996      4096.00
       4.995     0.999780         9996      4551.11
       5.595     0.999805         9997      5120.00
       5.595     0.999829         9997      5851.43
       5.595     0.999854         9997      6826.67
       5.595     0.999878         9997      8192.00
       5.595     0.999890         9997      9102.22
       5.975     0.999902         9998     10240.00
       5.975     1.000000         9998          inf
#[Mean    =        1.275, StdDeviation   =        0.440]
#[Max     =        5.972, Total count    =         9998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9999 requests in 10.00s, 810.47KB read
Requests/sec:    999.90
Transfer/sec:     81.05KB